; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	image1 - mode
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	thermograph4 - mode
	GroundStation2 - direction
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Planet23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star1)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon21)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star3)
	(supports instrument8 thermograph4)
	(supports instrument8 thermograph3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star3)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star3)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph4)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star1)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
	(supports instrument12 thermograph4)
	(calibration_target instrument12 Star3)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon18)
)
(:goal (and
	(have_image Phenomenon5 thermograph4)
	(have_image Planet7 image1)
	(have_image Star8 thermograph3)
	(have_image Star9 image1)
	(have_image Star10 image1)
	(have_image Phenomenon13 thermograph2)
	(have_image Star15 thermograph2)
	(have_image Phenomenon17 thermograph4)
	(have_image Phenomenon18 image1)
	(have_image Planet19 thermograph2)
	(have_image Planet20 thermograph4)
	(have_image Phenomenon21 image1)
	(have_image Star22 thermograph3)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 13
2. (turn-to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 0 of 13
3. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn-to satellite0 planet7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet7)
   goals met: 0 of 13
5. (take-image satellite0 planet7 instrument2 image1)
   added: (have_image planet7 image1)
   goals met: 1 of 13
6. (turn-to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 1 of 13
7. (take-image satellite0 star9 instrument2 image1)
   added: (have_image star9 image1)
   goals met: 2 of 13
8. (turn-to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 2 of 13
9. (take-image satellite0 star10 instrument2 image1)
   added: (have_image star10 image1)
   goals met: 3 of 13
10. (turn-to satellite0 phenomenon18 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon18)
   goals met: 3 of 13
11. (take-image satellite0 phenomenon18 instrument2 image1)
   added: (have_image phenomenon18 image1)
   goals met: 4 of 13
12. (turn-to satellite0 phenomenon21 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon21)
   goals met: 4 of 13
13. (take-image satellite0 phenomenon21 instrument2 image1)
   added: (have_image phenomenon21 image1)
   goals met: 5 of 13
14. (switch-on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 5 of 13
15. (turn-to satellite2 star3 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star3)
   goals met: 5 of 13
16. (calibrate satellite2 instrument8 star3)
   added: (calibrated instrument8)
   goals met: 5 of 13
17. (turn-to satellite2 phenomenon17 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon17)
   goals met: 5 of 13
18. (take-image satellite2 phenomenon17 instrument8 thermograph4)
   added: (have_image phenomenon17 thermograph4)
   goals met: 6 of 13
19. (turn-to satellite2 phenomenon5 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon5)
   goals met: 6 of 13
20. (take-image satellite2 phenomenon5 instrument8 thermograph4)
   added: (have_image phenomenon5 thermograph4)
   goals met: 7 of 13
21. (turn-to satellite2 planet20 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet20)
   goals met: 7 of 13
22. (take-image satellite2 planet20 instrument8 thermograph4)
   added: (have_image planet20 thermograph4)
   goals met: 8 of 13
23. (turn-to satellite2 star8 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 star8)
   goals met: 8 of 13
24. (take-image satellite2 star8 instrument8 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 9 of 13
25. (turn-to satellite2 star22 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star22)
   goals met: 9 of 13
26. (take-image satellite2 star22 instrument8 thermograph3)
   added: (have_image star22 thermograph3)
   goals met: 10 of 13
27. (turn-to satellite2 star10 star22)
   deleted: (pointing satellite2 star22)
   added: (pointing satellite2 star10)
   goals met: 10 of 13
28. (turn-to satellite2 phenomenon13 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon13)
   goals met: 10 of 13
29. (take-image satellite2 phenomenon13 instrument8 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 11 of 13
30. (turn-to satellite2 star15 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star15)
   goals met: 11 of 13
31. (take-image satellite2 star15 instrument8 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 12 of 13
32. (turn-to satellite2 planet7 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 planet7)
   goals met: 12 of 13
33. (turn-to satellite2 planet19 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet19)
   goals met: 12 of 13
34. (take-image satellite2 planet19 instrument8 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 13 of 13
